In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import os

In [2]:
drinks=pd.read_csv('http://bit.ly/drinksbycountry')
movies=pd.read_csv('http://bit.ly/imdbratings')
orders=pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price']=orders.item_price.str.replace('$', '').astype('float')
stocks=pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic=pd.read_csv('http://bit.ly/kaggletrain')
ufo=pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

C:\Users\Dan Masibo\AppData\Local\Temp\ipykernel_11312\2056548367.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price']=orders.item_price.str.replace('$', '').astype('float')

## 1. show installed versions

In [3]:
pd.__version__

'1.4.2'

In [4]:
np.__version__

'1.21.5'

In [5]:
sns.__version__

'0.11.2'

## 2. create a DataFrame

In [6]:
df=pd.DataFrame({' col one ':[200, 300, 600],
                'col two ':[400, 500, 800]})
df

    col one   col two
0        200       400
1        300       500
2        600       800

In [7]:
# df.columns=df.columns.str.replace(' ', '_')

In [8]:
df

    col one   col two
0        200       400
1        300       500
2        600       800

In [9]:
df.columns

Index([' col one ', 'col two '], dtype='object')

In [10]:
# df.columns=df.columns.str.lstrip()

In [11]:
df.columns

Index([' col one ', 'col two '], dtype='object')

In [12]:
# df.columns=df.columns.str.rstrip()

In [13]:
df.columns

Index([' col one ', 'col two '], dtype='object')

In [14]:
df.columns=df.columns.str.strip()
df.columns

Index(['col one', 'col two'], dtype='object')

In [15]:
df

   col one  col two
0      200      400
1      300      500
2      600      800

In [16]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [17]:
drinks.shape

(193, 6)

In [18]:
# reverse rows

drinks.loc[::-1,].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

In [19]:
# reverse columns

drinks.loc[:, ::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

In [20]:
# num_cols_1=drinks.select_dtypes(exclude='object')
# num_cols_1.head()

In [21]:
cat_cols=[col for col in drinks.columns if drinks[col].dtypes=='O']
drinks[cat_cols].head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [22]:
# num_cols=[col for col in drinks.columns if drinks[col].dtypes !='O']
# drinks[num_cols].head()

In [23]:
num_cols_1=drinks.select_dtypes(include='int64')
num_cols_1.head()

   beer_servings  spirit_servings  wine_servings
0              0                0              0
1             89              132             54
2             25                0             14
3            245              138            312
4            217               57             45

In [24]:
# drinks.info()

In [25]:
df

   col one  col two
0      200      400
1      300      500
2      600      800

In [26]:
df=df.rename({'col one':'f_col', 'col two':'s_col'}, axis=1)
df

   f_col  s_col
0    200    400
1    300    500
2    600    800

In [27]:
df=df.rename(columns={'f_col':'col_one', 's_col':'col_two'})
df

   col_one  col_two
0      200      400
1      300      500
2      600      800

In [28]:
df_2=pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                  'col_two':['4.4', '5.5', '5.5'],
                  'col_three':['6.6', '7.7', '8.8']})
df_2

  col_one col_two col_three
0     1.1     4.4       6.6
1     2.2     5.5       7.7
2     3.3     5.5       8.8

In [29]:
df_2["col_one"].values

array(['1.1', '2.2', '3.3'], dtype=object)

In [30]:
df_2["col_two"].values

array(['4.4', '5.5', '5.5'], dtype=object)

In [31]:
df_2["col_three"].values

array(['6.6', '7.7', '8.8'], dtype=object)

In [32]:
df_2=df_2.astype({'col_one':'float', 'col_two':'float', 'col_three':'float'})

In [33]:
df_2.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

In [34]:
# pd.to_numeric(df_2['col_one', 'col_two', 'col_three'], errors='coerce')

## Show file size in memory

In [35]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [36]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [37]:
cols=['beer_servings', 'continent']
small_drinks=pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols)
small_drinks.head()

   beer_servings continent
0              0      Asia
1             89    Europe
2             25    Africa
3            245    Europe
4            217    Africa

In [38]:
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

In [39]:
dtypes={'continent':'category'}
small_drinks=pd.read_csv("http://bit.ly/drinksbycountry", 
                         usecols=cols, dtype=dtypes)
small_drinks.head()

   beer_servings continent
0              0      Asia
1             89    Europe
2             25    Africa
3            245    Europe
4            217    Africa

In [40]:
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

## Filter DataFrame by Multiple Categories

In [41]:
movies.head(3)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [42]:
# movies[['genre', 
#         'duration']].groupby('genre', 
#                              as_index=False).count().sort_values(by='duration', 
#                                                                ascending=False)

In [43]:
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [44]:
movies[(movies.genre=='Action')|
      (movies.genre=='Drama')|
      (movies.genre=='Western')].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."

In [45]:
report_1=movies[movies.genre.isin(['Action', 'Drama', 'Western'])]
report_1.head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."

In [46]:
os.getcwd()

'C:\\Users\\Dan Masibo'

In [47]:
report_1.to_csv('report_1.csv', index=None)

In [48]:
movies[~movies.genre.isin(['Action', 'Drama', 'Western'])].head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."

In [49]:
movies[~movies.genre.isin(['Action', 'Drama', 'Western'])]['genre'].unique()

array(['Crime', 'Adventure', 'Biography', 'Comedy', 'Animation',
       'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi', 'History', 'Thriller',
       'Family', 'Fantasy'], dtype=object)

In [50]:
counts=movies.genre.value_counts()
counts.nlargest(5)

Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Name: genre, dtype: int64

In [51]:
counts.nlargest(5).index

Index(['Drama', 'Comedy', 'Action', 'Crime', 'Biography'], dtype='object')

## Handling Missing Values

In [52]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [53]:
ufo.isna().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [54]:
ufo.isna().sum().sum()

18028

In [55]:
(ufo.isna().mean()*100).round(2)

City                0.14
Colors Reported    84.20
Shape Reported     14.49
State               0.00
Time                0.00
dtype: float64

In [56]:
ufo.dropna(axis='columns', how='any')

      State                Time
0        NY 1930-06-01 22:00:00
1        NJ 1930-06-30 20:00:00
2        CO 1931-02-15 14:00:00
3        KS 1931-06-01 13:00:00
4        NY 1933-04-18 19:00:00
...     ...                 ...
18236    IL 2000-12-31 23:00:00
18237    IA 2000-12-31 23:00:00
18238    WI 2000-12-31 23:45:00
18239    WI 2000-12-31 23:45:00
18240    FL 2000-12-31 23:59:00

[18241 rows x 2 columns]

In [57]:
ufo.dropna(thresh=len(ufo)*0.9, axis='columns').head().isna().mean()*100

City     0.0
State    0.0
Time     0.0
dtype: float64

## split a string into multiple columns

In [58]:
df=pd.DataFrame({'name':['John Arthur Doe', 'Jane Ann Smith'],
             'location':['Los Angeles, CA', 'Washington, DC']})
df

              name         location
0  John Arthur Doe  Los Angeles, CA
1   Jane Ann Smith   Washington, DC

In [59]:
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [60]:
df[['f_name', 'm_name', 'l_name']]=df.name.str.split(' ', expand=True)

In [61]:
df

              name         location f_name  m_name l_name
0  John Arthur Doe  Los Angeles, CA   John  Arthur    Doe
1   Jane Ann Smith   Washington, DC   Jane     Ann  Smith

In [62]:
df=df.drop(['name'], axis=1)

In [63]:
df

          location f_name  m_name l_name
0  Los Angeles, CA   John  Arthur    Doe
1   Washington, DC   Jane     Ann  Smith

In [64]:
df['City']=df.location.str.split(',', expand=True)[0]
df

          location f_name  m_name l_name         City
0  Los Angeles, CA   John  Arthur    Doe  Los Angeles
1   Washington, DC   Jane     Ann  Smith   Washington

In [65]:
df.columns

Index(['location', 'f_name', 'm_name', 'l_name', 'City'], dtype='object')

In [66]:
df=df.loc[:, ['f_name', 'm_name', 'l_name', 'location', 'City']]
df

  f_name  m_name l_name         location         City
0   John  Arthur    Doe  Los Angeles, CA  Los Angeles
1   Jane     Ann  Smith   Washington, DC   Washington

## Expand a series of lists into a DataFrame

In [67]:
df=pd.DataFrame({'col_one':['a', 'b', 'c'],
                'col_two':[[10, 40], [20, 50], [30, 60]]})
df

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

In [68]:
df_new=df.col_two.apply(pd.Series)

In [69]:
df_new

    0   1
0  10  40
1  20  50
2  30  60

In [70]:
pd.concat([df,df_new], axis=1)

  col_one   col_two   0   1
0       a  [10, 40]  10  40
1       b  [20, 50]  20  50
2       c  [30, 60]  30  60

## Aggregate by Multiple Functions

In [71]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

## Combine the output of an Aggregation with a DataFrame

In [72]:
orders[orders.order_id==1]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39

In [73]:
orders[orders.order_id==1].item_price.sum()

11.56

In [74]:
orders.groupby('order_id').item_price.sum().head()

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

In [75]:
orders.groupby('order_id').item_price.agg(['sum', 'count']).head()

            sum  count
order_id
1         11.56      4
2         16.98      1
3         12.67      2
4         21.00      2
5         13.70      2

In [76]:
orders.shape

(4622, 5)

In [77]:
import os 
os.chdir(r"C:\Users\Dan Masibo\Documents\mwaura")

In [78]:
df=pd.read_excel('sales_october.xlsx')
df.head(3)

,Unnamed: 0,PIN of Customer,Name of Customer,ETR Serial Number,Bill Date,Bill No,Desscription of Goods/Services,Sales Value (Kshs),Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,NaN,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,3600.0,IPD,CASH SALE,NaN,NaN
1,NaN,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,6000.0,IPD,CASH SALE,NaN,NaN
2,NaN,0,CASH,NaN,2022-10-03,IPF-7294-22,Medical Services,2400.0,IPD,CASH SALE,NaN,NaN

In [79]:
df.columns

Index(['Unnamed: 0', 'PIN of Customer', 'Name of Customer',
       'ETR Serial Number', 'Bill Date', 'Bill No',
       'Desscription of Goods/Services', 'Sales Value (Kshs)', 'Unnamed: 8',
       'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11'],
      dtype='object')

In [80]:
df.columns=df.columns.str.replace(' ', '_')
df.columns

Index(['Unnamed:_0', 'PIN_of_Customer', 'Name_of_Customer',
       'ETR_Serial_Number', 'Bill_Date', 'Bill_No',
       'Desscription_of_Goods/Services', 'Sales_Value_(Kshs)', 'Unnamed:_8',
       'Unnamed:_9', 'Unnamed:_10', 'Unnamed:_11'],
      dtype='object')

In [81]:
df.shape

(62774, 12)

In [82]:
df.groupby('Bill_No')['Sales_Value_(Kshs)'].agg(['sum', 
                                                 'count']).sort_values(by='count', 
                                                                      ascending=False).head(10)

                      sum  count
Bill_No
IPF-7518-22    1150000.00    648
IPF-7774-22     808500.00    341
IPF-7497-22     615000.00    305
IPFCA18188-22   776000.00    256
IPFCA18314-22   443600.00    249
IPF-7818-22     640700.00    234
IPFCA18456-22   642128.59    218
IPFCA18510-22   408990.00    210
IPFCA18356-22   403572.11    206
IPF-7656-22     451750.00    200

In [83]:
agg_sales=df.groupby('Bill_No')['Sales_Value_(Kshs)'].transform('sum')
agg_sales

0        148687.14
1        148687.14
2         48972.55
3         48972.55
4         59704.19
           ...
62769    -17825.00
62770    -17825.00
62771      -240.00
62772    -12000.00
62773     -5500.00
Name: Sales_Value_(Kshs), Length: 62774, dtype: float64

In [84]:
agg_sales.shape

(62774,)

In [85]:
df['agg_sales']=agg_sales

In [86]:
df.head(3)

,Unnamed:_0,PIN_of_Customer,Name_of_Customer,ETR_Serial_Number,Bill_Date,Bill_No,Desscription_of_Goods/Services,Sales_Value_(Kshs),Unnamed:_8,Unnamed:_9,Unnamed:_10,Unnamed:_11,agg_sales
0,NaN,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,3600.0,IPD,CASH SALE,NaN,NaN,148687.14
1,NaN,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,6000.0,IPD,CASH SALE,NaN,NaN,148687.14
2,NaN,0,CASH,NaN,2022-10-03,IPF-7294-22,Medical Services,2400.0,IPD,CASH SALE,NaN,NaN,48972.55

In [87]:
df=df.drop(['Sales_Value_(Kshs)'], axis=1)
df.head(3)

,Unnamed:_0,PIN_of_Customer,Name_of_Customer,ETR_Serial_Number,Bill_Date,Bill_No,Desscription_of_Goods/Services,Unnamed:_8,Unnamed:_9,Unnamed:_10,Unnamed:_11,agg_sales
0,NaN,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,IPD,CASH SALE,NaN,NaN,148687.14
1,NaN,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,IPD,CASH SALE,NaN,NaN,148687.14
2,NaN,0,CASH,NaN,2022-10-03,IPF-7294-22,Medical Services,IPD,CASH SALE,NaN,NaN,48972.55

In [90]:
df=df.rename(columns={'agg_sales':'Sales_Value_(Kshs)'})

In [91]:
df.head(2)

,Unnamed:_0,PIN_of_Customer,Name_of_Customer,ETR_Serial_Number,Bill_Date,Bill_No,Desscription_of_Goods/Services,Unnamed:_8,Unnamed:_9,Unnamed:_10,Unnamed:_11,Sales_Value_(Kshs)
0,NaN,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,IPD,CASH SALE,NaN,NaN,148687.14
1,NaN,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,IPD,CASH SALE,NaN,NaN,148687.14

In [93]:
df=df.drop_duplicates('Bill_No', keep='first')
df.shape

(6610, 12)

In [97]:
df.head(10)

,PIN_of_Customer,Name_of_Customer,ETR_Serial_Number,Bill_Date,Bill_No,Desscription_of_Goods/Services,Unnamed:_8,Unnamed:_9,Unnamed:_10,Unnamed:_11,Sales_Value_(Kshs)
0,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,IPD,CASH SALE,NaN,NaN,148687.14
2,0,CASH,NaN,2022-10-03,IPF-7294-22,Medical Services,IPD,CASH SALE,NaN,NaN,48972.55
4,0,CASH,NaN,2022-10-08,IPF-7366-22,Medical Services,IPD,CASH SALE,NaN,NaN,59704.19
6,0,CASH,NaN,2022-10-14,IPF-7452-22,Medical Services,IPD,CASH SALE,NaN,NaN,82701.00
7,0,NHIF,NaN,2022-10-17,IPF-7490-22,Medical Services,IPD,CREDIT SALE,NaN,NaN,87500.00
8,0,NHIF,NaN,2022-10-17,IPF-7493-22,Medical Services,IPD,CREDIT SALE,NaN,NaN,43500.00
9,0,NHIF,NaN,2022-10-17,IPF-7494-22,Medical Services,IPD,CREDIT SALE,NaN,NaN,78900.00
11,0,NHIF,NaN,2022-10-17,IPF-7496-22,Medical Services,IPD,CREDIT SALE,NaN,NaN,84600.00
14,0,NHIF,NaN,2022-10-17,IPF-7497-22,Medical Services,IPD,CREDIT SALE,NaN,NaN,615000.00
17,0,NHIF,NaN,2022-10-18,IPF-7518-22,Medical Services,IPD,CREDIT SALE,NaN,NaN,1150000.00

In [94]:
df=df.drop('Unnamed:_0', axis=1)

In [95]:
df.shape

(6610, 11)

In [98]:
df=df.reset_index(drop=True)
df

,PIN_of_Customer,Name_of_Customer,ETR_Serial_Number,Bill_Date,Bill_No,Desscription_of_Goods/Services,Unnamed:_8,Unnamed:_9,Unnamed:_10,Unnamed:_11,Sales_Value_(Kshs)
0,0,CASH,NaN,2022-10-01,IPF-7281-22,Medical Services,IPD,CASH SALE,NaN,NaN,148687.14
1,0,CASH,NaN,2022-10-03,IPF-7294-22,Medical Services,IPD,CASH SALE,NaN,NaN,48972.55
2,0,CASH,NaN,2022-10-08,IPF-7366-22,Medical Services,IPD,CASH SALE,NaN,NaN,59704.19
3,0,CASH,NaN,2022-10-14,IPF-7452-22,Medical Services,IPD,CASH SALE,NaN,NaN,82701.00
4,0,NHIF,NaN,2022-10-17,IPF-7490-22,Medical Services,IPD,CREDIT SALE,NaN,NaN,87500.00
...,...,...,...,...,...,...,...,...,...,...,...
6605,P000612260M,FIRST ASSURANCE,NaN,2022-10-06,PRF-12842,NaN,OPD,CREDIT SALE,NaN,NaN,-884.40
6606,P051752620Z,MAKL-TSC OUTPATIENT SCHEME,NaN,2022-10-23,PRF-13479,NaN,OPD,CREDIT SALE,NaN,NaN,-17825.00
6607,0,NHIF,NaN,2022-10-24,PRF-13524,NaN,OPD,CREDIT SALE,NaN,NaN,-240.00
6608,P051752620Z,AON MAKL-TSC,NaN,2022-10-08,IPCr-292,NaN,OPD,CREDIT SALE,NaN,NaN,-12000.00
6609,P051752620Z,AON MAKL-TSC,NaN,2022-10-11,IPCr-301,NaN,OPD,CREDIT SALE,NaN,NaN,-5500.00

In [99]:
df.to_excel('summary_5.xlsx', index=None)